{
    "probe": {
        "name": "JupiterFlyer",
        "base": "EarthL2",
        "pmass": 500.0
    },
    "target": {
        "name": "Jupiter",
        "file": "",
        "SPKID1A": 0,
        "SPKID1B": 5,
        "SPKID2A": 0,
        "SPKID2B": 0
    },
    "maneuvers": [
        {
            "type": "START",
            "time": 2458934.5,
            "dv": 9130.0,
            "phi": -4.7,
            "elv": -8.0,
            "description_ja": "このマヌーバは探査機を木星に向けて出発させます。出発は 2020 年 3 月 26 日です。\n出発時の軌道で飛行すると、探査機は 563 日後の 2021 年 10 月 10 日に木星に接近します。\n\nこの飛行計画の目標は、木星でのスイングバイを試すことです。",
            "description_en": "This Maneuver sends off the Probe toward Jupiter.  The Probe leaves the space station \"Earth L2\" on 2020-03-26 (March 26, 2020).  The Probe arrives at Jupiter on 2021-10-10 (October 10, 2021) after 563 days of spaceflight.\n\nThe objective of the spaceflight is to try an orbital transition by swing-by of Jupiter."
        },
        {
            "type": "FLYTO",
            "time": 2459350.5,
            "inter": 1.0,
            "description_ja": "このマヌーバは探査機を 2021 年 5 月 16 日までの 416 日間飛行させます。",
            "description_en": "This Maneuver flies the Probe for 416 days until 2021-05-16 (May 16, 2021)."
        },
        {
            "type": "CP",
            "dv": 378.845,
            "phi": -156.42,
            "elv": 3.51,
            "description_ja": "このマヌーバは化学推進エンジンを使用して探査機の軌道を変更します。\n\nこの時点の探査機の軌道は次のようです。\n　約 150 日後に木星に接近する\n　太陽の側から木星に接近して近くを通り過ぎる\n\nこの場合、探査機が木星の近くを通り過ぎる経路は大まかに言うと 4 種類あります。木星の軌道の前方を通り過ぎる経路、後方を通り過ぎる経路、北極上空を通る経路、そして南極上空を通る経路です。\n\nこのマヌーバでは、150 日後に木星の軌道の後ろ側を 5000000 km （5百万キロメートル）離れて通り過ぎる軌道に探査機を乗せることにしました。\n\nマヌーバのパラメータは FTA を使用して求めました。FTA の実行条件は次のようになります。\n　飛行時間： 150 日\n　目標位置の設定方法： Bプレーン座標\n　オフセット距離： 5000000 km\n　beta （角度ベータ）： 0.0 度\n\nFTAの実行条件のうち、オフセット距離と beta の値を変更すると、様々なスイングバイを試してみることができます。\n\n",
            "description_en": "This Maneuver performs an orbital transition of the Probe using Chemical Propulsion Engine.  The Maneuver defines characteristics of the Jupiter swing-by.\n\nAt this point, the Probe will arrive at Jupiter in 150 days; it will approach Jupiter from the sun side.\n\nIn this case, there are four typical routes for the Probe to pass by Jupiter: the one that passes in front of Jupiter, the one that passes behind, the one that passes above the north pole, and the one that passes above the south pole.\n\nFor the Maneuver, we selected a route that passes behind Jupiter with a distance of five million kilometers.  We obtained the parameters of the Maneuver by the FTA function, and the execution conditions of the FTA were as follows:\n\n  Time to Arrival: 150 days\n  Precise Targeting:  B-plane coordinates\n  offset distance: 5000000 km\n  beta: 0.0 deg\n\nIf you wish to try other routes, change the value of the offset distance and/or the angle beta.\n\n"
        },
        {
            "type": "FLYTO",
            "time": 2459650.5,
            "inter": 1.0,
            "description_ja": "このマヌーバは探査機を 2022 年 3 月 12 日までの 300 日間飛行させます。\n\nこの飛行の間に探査機は木星スイングバイを行い、軌道が大きく変化します。このマヌーバの実行の直後に飛行レビューを実行すれば、探査機の経路や木星スイングバイでの軌道の変化が詳しく観察できるでしょう。",
            "description_en": "This Maneuver flies the Probe for 300 days until 2022-03-12 (March 12, 2022).\n\nThe Probe performs a Jupiter swing-by and changes its orbit violently during the flight.  To observe the trajectory and the orbit of the Probe during the swing-by, try [REVIEW Recent] button of SSVG immediately after the execution of the Maneuver. "
        }
    ]
}