{
    "target": {
        "name": "Mars",
        "file": "",
        "SPKID1A": 0,
        "SPKID1B": 4,
        "SPKID2A": 0,
        "SPKID2B": 0
    },
    "probe": {
        "name": "Mars_SS",
        "base": "EarthL2",
        "pmass": 500.0
    },
    "maneuvers": [
        {
            "type": "START",
            "phi": 0.0,
            "time": 2459344.5,
            "elv": -90.0,
            "dv": 960.0,
            "description_ja": "2021 年 5 月 10 日に、探査機を黄道面の南極の方向に出発させます。出発速度は 960 m/s です。\n\nこの飛行計画では、主にソーラーセイルを用いて探査機を火星に到達させます。飛行計画を作り上げる戦略として、早い時期に探査機の軌道面を火星の軌道面に一致させることを選択しました。\n\n探査機を宇宙基地から出発させる START マヌーバの役割は、探査機が火星と同じ軌道面を持つように、宇宙飛行に送り出すことです。このため、以下のような方法でパラメータを設定しました。\n\n　出発時刻：宇宙基地が火星の軌道面にちょうど重なる日を選びました。\n　phi （角度ファイ）： 0.0 度。黄道面に垂直に加速するので、どんな値にしてもかまいません。\n　elv （上下角）： -90 度。出発時刻に宇宙基地が火星の軌道面の南から北に横切る運動をしているため。\n　dv （デルタV の絶対値）： 出発後の探査機の軌道面が火星の軌道面に一致するように選びました。",
            "description_en": "This Maneuver sends off the Probe on 2021-05-10 (May 10, 2021).  The initial flight direction relative to the space base \"Earth L2\" is southward of ecliptic plane; the magnitude of the initial velocity relative to the space base is 960 m/s (meters per second).\n\nWe attempt to fly the Probe to Mars using the Solar Sail as the main propulsion system.  One of the strategies for the Flight Plan is to bring the orbital plane of the Probe in line with the one of Mars in the earliest phase of the spaceflight.\n\nThe parameters of the Maneuver that sends off the Probe were determined as follows:\n\n  Start Time: One of the days when the Space Base passes through the orbital plane of Mars.\n  phi: 0.0 deg.  (We may use any value)\n  elv: -90.0 deg.  Southward, perpendicular to the ecliptic plane.\n  dv: 960 m/s.  Determined by cut-and-tries to bring the orbital plane of the Probe in line with the one of Mars.\n\n"
        },
        {
            "type": "SS_ON",
            "tvmode": "L",
            "elv": 0.0,
            "theta": 35.26,
            "description_ja": "ソーラーセイルをオンにします。\n\nまずは宇宙基地（というよりは地球）からできるだけ早く離れることが肝心です。また、探査機の軌道面は変えたくありません。そこで次のようにパラメータを設定しました。\n\n　elv （上下角）： 0.0 度。軌道面を変化させないため。\n　theta （角度シータ）： 35.26 度　ソーラーセイルの推力の軌道前方への分力が最大になる角度です。\n　area （ソーラーセイルの面積）： 10000 平方メートル。SSVGでは面積は自由に決められるのですが、この飛\n　　行計画ではソーラーセイルの面積を 10000 平方メートルに固定しています。\n　tvmode （推力方向モード）： L　推力を探査機の加速に効率よく働かせることのできるモードです。",
            "description_en": "This Maneuver turns on the Solar Sail.\n\nIt is important that the Probe draws away from the Earth as quickly as possible to minimize the gravitational disturbance from the Earth; we determined the parameters of the Maneuver as follows:\n\n  elv: 0.0 deg.  The angle not to change the orbital plane of the Probe.\n  theta: 35.26 deg.  The angle to maximize the forward component of the thrust of the Solar Sail.\n  area: 10000 square meters.  We use this value throughout the spaceflight.\n  tvmode: L",
            "area": 10000.0
        },
        {
            "type": "FLYTO",
            "time": 2459544.5,
            "inter": 1.0,
            "description_ja": "探査機を 11 月 26 日まで 200 日間飛行させます。\n\nこの飛行の間に探査機はソーラーセイルの推力を受けて軌道が大きくなります。また、地球との距離も大きくなります。",
            "description_en": "This Maneuver flies the Probe for 200 days until 2021-11-26 (November 26, 2021).\n\nThe Solar Sail accelerates the Probe continuously throughout the flight.  The orbit expands and the Probe draws away from the Earth."
        },
        {
            "type": "SS_OFF",
            "description_ja": "ソーラーセイルをオフにします。\n\nこの時点で、探査機の軌道面の向きを確認しました。\n火星の軌道を真横から眺めてみたところ、探査機の軌道が微妙に傾いていることが分かりました。\n\n火星の軌道面と探査機の位置の関係を確認すると、29日後の 2021 年 12 月 25 日ごろに探査機が火星の軌道面を横切るようです。この付近で探査機の軌道面を回転させることにしました。\n\n検討の結果、この軌道変更（軌道面の変更）をソーラーセイルのみで実施するにはちょうど 30 日のソーラーセイルの運用が必要なことが分かりました。",
            "description_en": "This Maneuver turns off the Solar Sail.\n\nAt this point, we observed the orientation of the orbit of the Probe and found out it inclined slightly relative to the orbit of Mars.\n\nWe found that the Probe would pass through the orbital plane of Mars on 2021-12-25 (December 25, 2021) or around.\n\nWe decided to perform an orbital transition to rotate the orbital plane to make it match in line with the one of Mars.  It takes 30 days with the thrust of the Solar Sail."
        },
        {
            "type": "FLYTO",
            "time": 2459558.5,
            "inter": 1.0,
            "description_ja": "探査機を 12 月 10 日まで 14 日間飛行させます。\n\nこの日は、軌道面変更を行うソーラーセイル運用の中央の日付（2021 年 12 月 25日）の 15 日前です。",
            "description_en": "This Maneuver flies the Probe for 14 days until 2021-12-10 (December 10, 2021).  It is the day before 15 days of the middle of the operation period of the Solar Sail."
        },
        {
            "type": "SS_ON",
            "elv": 35.26,
            "theta": 0.0,
            "tvmode": "L",
            "description_ja": "ソーラーセイルをオンにします。\n\n引き続く FLYTO マヌーバで探査機の軌道面を変更するため、パラメータを次のように設定しました。\n\n　elv （上下角）： 35.26 度　ソーラーセイルの推力の軌道北極方向への分力が最大になる角度です。\n　area （ソーラーセイルの面積）： 10000 平方メートル\n　theta （角度シータ）： 0.0 度\n　tvmode （推力方向モード）： L",
            "area": 10000.0,
            "description_en": "This Maneuver turns on the Solar Sail.\n\nWe selected the following parameters to rotate the orbital plane of the Probe.\n\n  elv: 35.26 deg.  The angle to maximize the northern component of the thrust.\n  area:  10000 square meters\n  theta:  0.0 deg\n  tvmode:  L"
        },
        {
            "type": "FLYTO",
            "time": 2459588.5,
            "inter": 1.0,
            "description_ja": "探査機を 2022 年 1 月 9 日まで 30 日間飛行させます。\n\nこの飛行の間にソーラーセイルの推力が働き、探査機の軌道面が変化します。",
            "description_en": "This Maneuver flies the Probe for 30 days until 2022-01-09 (January 9, 2022).\n\nThe thrust of the Solar Sail rotates the orbital plane of the Probe throughout the flight."
        },
        {
            "type": "SS_OFF",
            "description_ja": "ソーラーセイルをオフにします。\n\n火星の軌道面と探査機の軌道の関係を調べると、どうやら軌道面の変更は成功しているようです。探査機の軌道面が火星の軌道面にほとんど一致しました。",
            "description_en": "This Maneuver turns off the Solar Sail.\n\nAt this point, we observed the orbit of the Probe and found that the orbital plane was mostly in line with the one of Mars."
        },
        {
            "type": "SS_ON",
            "elv": 0.0,
            "theta": 35.26,
            "tvmode": "L",
            "description_ja": "ソーラーセイルをオンにします。\n\nこれからしばらくの間、ソーラーセイルをめいっぱい働かせて探査機の軌道を大きくし、火星の軌道に近づけます。パラメータは次のように設定します。\n\n　elv （上下角）： 0.0 度\n　area （ソーラーセイルの面積）： 10000 平方メートル\n　theta （角度シータ）： 35.26 度　ソーラーセイルの推力の軌道前方への分力が最大になる角度です。\n　tvmode （推力方向モード）： L",
            "area": 10000.0,
            "description_en": "This Maneuver turns on the Solar Sail.\n\nAfter this point, we accelerate the Probe with the full thrust of the Solar Sail for a while.  We use the following parameters.\n\n  elv: 0.0 deg\n  area: 10000 square meters\n  theta: 35.26 deg.  The angle to maximize the forward component of the thrust\n  tvmode: L"
        },
        {
            "inter": 1.0,
            "type": "FLYTO",
            "time": 2459953.5,
            "description_ja": "探査機を 2023 年 1 月 9 日まで 1 年間（365 日）飛行させます。\n\n飛行中はソーラーセイルの推力が働き、探査機の軌道が徐々に大きくなります。",
            "description_en": "This Maneuver flies the Probe for 365 days until 2023-01-09 (January 9, 2023).\n\nThe thrust of the Solar Sail accelerates the Probe continuously throughout the flight."
        },
        {
            "type": "SS_ON",
            "elv": 0.0,
            "theta": 35.26,
            "tvmode": "L",
            "description_ja": "ソーラーセイルがオンの状態を継続します。\n\nソーラーセイルをめいっぱい働かせて探査機の軌道を大きくし、火星の軌道に近づけます。パラメータは引き続き次のように設定します。\n\n　elv （上下角）： 0.0 度\n　area （ソーラーセイルの面積）： 10000 平方メートル\n　theta （角度シータ）： 35.26 度　ソーラーセイルの推力の軌道前方への分力が最大になる角度です。\n　tvmode （推力方向モード）： L",
            "area": 10000.0,
            "description_en": "This Maneuver keeps the state of the Solar Sail.\n\nWe accelerate the Probe with the full thrust of the Solar Sail for a while.  We keep the parameters as follows:\n\n  elv: 0.0 deg\n  area: 10000 square meters\n  theta: 35.26 deg.  The angle to maximize the forward component of the thrust\n  tvmode: L"
        },
        {
            "inter": 1.0,
            "type": "FLYTO",
            "time": 2460223.5,
            "description_ja": "探査機を 10 月 6 日まで 270 日間飛行させます。\n\n飛行中はソーラーセイルの推力が働き、探査機の軌道は徐々に大きくなります。\n\n最初は1年間（365 日）続けて探査機を飛行させたのですが、それだと探査機の軌道が大きくなりすぎるようです。飛行を 270 日で打ち切って、火星に接近する方法を検討することにしました。",
            "description_en": "This Maneuver flies the Probe for 270 days until 2023-10-06 (October 6, 2023).\n\nThe thrust of the Solar Sail accelerates the Probe continuously throughout the flight.\n\nWe tried one year flight at first and found that it was too long.  We decided to reduce the duration of the flight into 270 days.  We would study the orbit to find out ways to approach Mars."
        },
        {
            "type": "SS_OFF",
            "description_ja": "ソーラーセイルをオフにします。\n\n検討の結果、2024 年 8 月 21 日ごろに 120 日間ソーラーセイルで加速する飛行を行えば火星への接近がやりやすくなることが分かりました。",
            "description_en": "This Maneuver turns off the Solar Sail.\n\nWe made a study of ways by which the Probe would approach Mars and found that the acceleration of the Probe by the Solar Sail on and around 2024-08-21 (August 21, 2024) would make much easier the approach to Mars.  It would take 120 days to accelerate the Probe properly."
        },
        {
            "type": "FLYTO",
            "time": 2460483.5,
            "inter": 1.0,
            "description_ja": "探査機を 2024 年 6 月 22 日まで 260 日間飛行させます。\n\nソーラーセイルはオフになっていますから、飛行しても探査機の軌道はほとんど変化しません。",
            "description_en": "This Maneuver flies the Probe for 260 days until 2024-06-22 (June 22, 2024).\n\nThe Solar Sail is off and it provides no acceleration to the Probe throughout the flight."
        },
        {
            "type": "SS_ON",
            "tvmode": "L",
            "elv": 0.0,
            "theta": 35.26,
            "description_ja": "ソーラーセイルをオンにします。\n\nこれから 120 日間、ソーラーセイルにより探査機を加速します。パラメータは次のように設定します。\n\n　elv （上下角）： 0.0 度\n　area （ソーラーセイルの面積）： 10000 平方メートル\n　theta （角度シータ）： 35.26 度　ソーラーセイルの推力の軌道前方への分力が最大になる角度です。\n　tvmode （推力方向モード） ： L",
            "area": 10000.0,
            "description_en": "This Maneuver turns on the Solar Sail.\n\nThe Solar Sail accelerates the Probe throughout the next flight.  The parameters are as follows:\n\n  elv: 0.0 deg\n  area: 10000 square meters\n  theta: 35.26 deg.  The angle to maximize the forward component of the thrust\n  tvmode: L"
        },
        {
            "inter": 1.0,
            "type": "FLYTO",
            "time": 2460603.5,
            "description_ja": "探査機を 10 月 20 日まで 120 日間飛行させます。\n\n飛行中はソーラーセイルの推力が働き、軌道が徐々に大きくなります。",
            "description_en": "This Maneuver flies the Probe for 120 days until 2024-10-20 (October 20, 2024).\n\nThe thrust of the Solar Sail accelerates the Probe continuously throughout the flight."
        },
        {
            "type": "SS_OFF",
            "description_ja": "ソーラーセイルをオフにします。\n\nここで、探査機を火星に接近させるためのマヌーバの検討を行いました。\n\n検討の結果、2025 年 6 月 18日ごろ 88 日間ぐらいソーラーセイルを働かせれば火星に接近する軌道になることが分かりました。\n\n",
            "description_en": "This Maneuver turns off the Solar Sail.\n\nAt this point, we studied the Maneuver to make the Probe approach Mars.  We found out an acceleration by Solar Sail on and around 2025-06-18 (June 18, 2025) would be required.  It would take 88 days for proper acceleration."
        },
        {
            "inter": 1.0,
            "type": "FLYTO",
            "time": 2460800.5,
            "description_ja": "探査機を 2025 年 5 月 5 日まで 197 日間飛行させます。\n\nソーラーセイルはオフになっていますので、飛行させても探査機の軌道はほとんど変化しません。",
            "description_en": "This Maneuver flies the Probe for 197 days until 2025-05-05 (May 5, 2025).\n\nThe Solar Sail is off and it provides no acceleration to the Probe throughout the flight."
        },
        {
            "type": "SS_ON",
            "elv": 0.0,
            "theta": 35.26,
            "tvmode": "L",
            "description_ja": "ソーラーセイルをオンにします。\n\n次の飛行の間、探査機を加速します。パラメータは次のとおりです。\n\n　elv （上下角）： 0.0 度\n　area （ソーラーセイルの面積）： 10000 平方メートル\n　theta （角度シータ）： 35.26 度　ソーラーセイルの推力の軌道前方への分力が最大になる角度です。\n　tvmode （推力方向モード）： L",
            "area": 10000.0,
            "description_en": "This Maneuver turns on the Solar Sail.\n\nThe Solar Sail accelerate the Probe throughout the next flight.  The parameters are as follows:\n\n  elv: 0.0 deg\n  area: 10000 square meters\n  theta: 35.26 deg.  The angle to maximize the forward component of the thrust\n  tvmode: L"
        },
        {
            "type": "FLYTO",
            "time": 2460893.5,
            "inter": 1.0,
            "description_ja": "探査機を 8 月 6 日まで 93 日間飛行させます。\n\n飛行中はソーラーセイルの推力が働き、探査機の軌道は徐々に大きくなります。\n\n当初の予定では飛行期間は 88 日間でしたが、軌道が火星にいっそう接近するよう飛行期間を延長しました。最適な飛行期間は、複数の飛行期間を試して見つけたものです。",
            "description_en": "This Maneuver flies the Probe for 93 days until 2025-08-06 (August 6, 2025).\n\nThe thrust of the Solar Sail accelerates the Probe continuously throughout the flight.  At the end of the flight, the Probe is on an orbit that brings it to Mars.\n\nAlthough we planned 88 days for the duration of the flight, we selected 93 days for it based on cut-and-tries to minify the closest distance to Mars."
        },
        {
            "type": "SS_OFF",
            "description_ja": "ソーラーセイルをオフにします。\n\n軌道を確認すると、探査機は 302 日後の 2026 年 6 月 4 日に火星に接近する軌道に乗っているようです。\n\n今後 2 回の小さな軌道修正を行い、火星に接近することにしました。1回目の軌道修正は、最接近位置までの位相角が 90 度ぐらいになる 2026 年 1 月 4 日に実施することにしました。2回目の軌道修正は、最接近の 50 日前ごろに実施する予定です。\n\nソーラーセイルによる加速はこれで終わりです。今後の軌道変更には化学推進エンジンを使用します。\n",
            "description_en": "This Maneuver turns off the Solar Sail.\n\nAt this point, we finish operations of the Solar Sail.  We use the Chemical Propulsion Engine for orbital transitions later.\n\nThe Probe is on the orbit that approaches Mars on  2026-06-04 (June 4, 2026) after 302 days of spaceflight.\n\nWe planned two times of orbital corrections to achieve the closest approach to Mars.  The first one would be on 2026-01-04 (January 4, 2026), and the second one would be about 50 days before the closest approach."
        },
        {
            "type": "FLYTO",
            "time": 2461044.5,
            "inter": 1.0,
            "description_ja": "探査機を 2026 年 1 月 4 日まで151 日間飛行させます。\n\n飛行後に1回目の軌道修正を行います。",
            "description_en": "This Maneuver flies the Probe for 151 days until 2026-01-04 (January 4, 2026)."
        },
        {
            "type": "CP",
            "dv": 28.477,
            "phi": 100.83,
            "elv": -78.28,
            "description_ja": "化学推進エンジンを用い、火星接近前の1回目の軌道修正を行います。\n\n軌道修正のためのパラメータは FTA を用いて計算しました。計算の条件は次のとおりです。\n\n　飛行時間： 151 日\n　目標位置の設定方法： B プレーン座標\n　オフセット距離： 20000 km\n　beta （角度ベータ）： 0.0 度",
            "description_en": "This Maneuver performs the first orbital correction before the closest approach to Mars.\n\nWe obtained the parameters of the Maneuver by the FTA of SSVG.  The execution conditions of the FTA were as follows:\n\n  Flight Time: 151 days\n  Precise Targeting: B-plane Coordinates\n  offset distance: 20000 km\n  beta: 0.0 deg"
        },
        {
            "type": "FLYTO",
            "time": 2461144.5,
            "inter": 1.0,
            "description_ja": "探査機を 4 月 14 日まで 100 日間飛行させます。\n\n飛行後に2回目の軌道修正を行います。",
            "description_en": "This Maneuver flies the Probe for 100 days until 2026-04-14 (April 14, 2026)."
        },
        {
            "type": "CP",
            "dv": 3.629,
            "phi": 101.74,
            "elv": -0.24,
            "description_ja": "化学推進エンジンを用い、火星接近前の2回目の軌道修正を行います。\n\n軌道修正のためのパラメータは FTA を用いて計算しました。計算の条件は次のとおりです。\n\n　飛行時間： 50 日\n　目標位置の設定方法： B プレーン座標\n　オフセット距離： 20000 km\n　beta （角度ベータ）： 0.0 度",
            "description_en": "This Maneuver performs the second orbital correction before the closest approach to Mars.\n\nWe obtained the parameters of the Maneuver by the FTA of SSVG.  The execution conditions of the FTA were as follows:\n\n  Flight Time: 50 days\n  Precise Targeting: B-plane Coordinates\n  offset distance: 20000 km\n  beta: 0.0 deg"
        },
        {
            "type": "FLYTO",
            "time": 2461192.229999999,
            "inter": 1.0,
            "description_ja": "探査機が火星に最も接近する時刻まで、探査機を飛行させます。飛行の期間は 47.73 日です。\n\n探査機が火星に最も接近する時刻は、複数の FLYTO マヌーバとそれらの飛行レビューを行って決定しました。実行した FLYTO マヌーバの一部は積分間隔（inter）の値を 0.001 日（1 分 26 秒）まで小さくしました。",
            "description_en": "This Maneuver flies the Probe until it arrives at the closest point to Mars.\n\nThe duration of the flight is 47.73 days.  We found the date and time when the Probe would come to the closest point to Mars by trial executions of FLYTO Maneuvers and \"Flight Reviews\" of them.  One of the FLYTO Maneuvers used very small value (0.001 days) for the parameter \"inter\"."
        },
        {
            "type": "CP",
            "dv": 243.35,
            "phi": 58.38,
            "elv": -0.2,
            "description_ja": "探査機を火星周回軌道に入れるための軌道変更を行います。\n\nこのマヌーバを実行する直前には、探査機は火星に対して約 4743 m/s の速度で飛行しています。この相対速度を充分に小さくする軌道変更を行えば、探査機は火星を周回するようになります。\n\nこのマヌーバのパラメータを考えるヒントは、軌道表示ウインドウにあります。このマヌーバ実行直前の「ターゲットの相対速度」の値がそれです。\n\nこのマヌーバのパラメータは次のようにして決定しました。\n　dv （デルタV の絶対値）： 複数の値を試し、探査機が火星周回軌道に入るものを選びました\n　phi （角度ファイ）： 「ターゲットの相対速度」の phi の値をそのまま使用しました\n　elv （上下角）： 「ターゲットの相対速度」の elv の値をそのまま使用しました",
            "description_en": "This Maneuver preforms orbital transition of the Probe that enters into a satellite orbit of Mars.\n\nAfter the execution of the last FLYTO Maneuver, the Probe was moving with a velocity of 4743 m/s relative to Mars.  This CP  Maneuver would reduce the relative velocity.\n\nWe determined the parameters of the Maneuver as follows:\n  dv: obtained from trial runs of this Maneuver and the FLYTO Maneuver in the next line\n  phi: obtained from Relative Velocity of Target after the execution of the last Maneuver\n  elv: ditto"
        },
        {
            "type": "FLYTO",
            "time": 2461197.229999999,
            "inter": 0.05,
            "description_ja": "火星周回軌道に入ったことを確認するため、探査機を 5 日間飛行させます。\n\n飛行レビューで探査機が火星を周回する様子を観察できるよう、積分間隔（パラメータ inter の値）を 0.05 日にしています。\n\n探査機は近点での火星中心からの距離が 3935 km （表面からの高度で約 535 km）の楕円軌道で火星を周回しています。軌道周期は地球時間で 1.65 日ほどです。\n\nこのマヌーバの実行直後に「飛行レビュー」を実行し、ターゲット（火星）の近傍を拡大して観察すれば、探査機が火星の周囲を飛行する様子が確認できるでしょう。",
            "description_en": "This Maneuver flies the Probe for 5 days to confirm that the Probe is orbiting around Mars."
        }
    ]
}