{
    "probe": {
        "name": "myprobe",
        "base": "EarthL2",
        "pmass": 500.0
    },
    "target": {
        "name": "Juno",
        "file": "2000003_Juno.bsp",
        "SPKID1A": 0,
        "SPKID2A": 0,
        "SPKID2B": 0,
        "SPKID1B": 2000003
    },
    "maneuvers": [
        {
            "type": "START",
            "time": 2461475.5,
            "dv": 6000.0,
            "phi": 0.0,
            "elv": 40.6,
            "description_ja": "この飛行計画は探査機を小惑星 Juno にランデブーさせるものです。しかしこのマヌーバ（START マヌーバ）は、探査機を直接 Juno に向けて送り出すのではなく、遠日点付近で Juno の軌道に接近するように出発させます。\n\n出発日は地球と宇宙基地が Juno の軌道面上に来る日を選びました。（2027-03-11）\n出発速度は 6000 m/s、phi はゼロとしました。\n探査機の軌道面が Juno の軌道面に近づき、探査機の実経路（FLYTO マヌーバによる飛行経路）が遠日点付近で Juno の軌道に接近するように elv の値を調整しました。\n\n探査機の実経路は 2028-04-09 に Juno の軌道に接近します。\n\n",
            "description_en": "The Probe makes a rendezvous with asteroid Juno at the last phase of the Flight Plan.  However, the Maneuver (FLYTO Maneuver) send it off to an orbit that does not reach Juno but the orbit of it.\n\nWe chose 2027-03-11 (March 11, 2027) for the Start Time of the spaceflight because Space Base Earth L2 comes onto the orbital plane of Juno at the date.\nWe took 6000 m/s for the magnitude of delta-V and zero for the \"phi.\"\nWe chose the value of \"elv\" by the following criteria.\n  - The Maneuver rotates the orbital plane of the Probe in the direction that reduces the inclination against the orbital plane of Juno.\n  - The real trajectory of the Probe (the result of an FLYTO Maneuver) reaches the orbit of Juno at the apoapsis.\n\nAfter the execution of the Maneuver, the Probe will reach the orbit of Juno at 2028-04-09 by its real trajectory.\n \n"
        },
        {
            "type": "FLYTO",
            "time": 2461745.5,
            "inter": 1.0,
            "description_ja": "2028-04-09 まで FLYTO マヌーバを実行した後で最適化アシスタントを使って調べてみると、どうやら 2028-06-23 に CP マヌーバによる軌道変更を行えば 1 公転後に Juno に接近できそうです。必要なデルタVは3735 m/s です。\n\nこれと同等な軌道変更を 400 日間の 電気推進エンジンの運用で実行するため、運用期間中央（2028-06-23）の 200 日前まで探査機を飛行させます。",
            "description_en": "We made a trial run of FLYTO Maneuver that flies the Probe until 2028-04-09 and used Optimize Assistant and found that a CP Maneuver on 2028-06-23 would make the Probe approach Juno after one orbit.  The magnitude of the delta-V of the CP Maneuver was 3735 m/s.\n\nTo make an equivalent orbital transition with a 400-day operation of the electric propulsion engine, the FLYTO Maneuver flies the Probe until 2027-12-06.  It is 200 days before the midpoint of the operation period of the engine."
        },
        {
            "type": "EP_ON",
            "dvpd": 11.492,
            "phi": 71.03,
            "elv": -15.81,
            "tvmode": "E",
            "description_ja": "電気推進エンジン（EP）をオンにし、今後 400 日間のパワーフライトで使用するパラメータを設定します。\n\n400 日間のパワーフライトにより、約 1 公転後の 2031-05-03 にターゲットに接近する軌道に乗せることを目指しています。\n\nEPのパラメータはカットアンドトライにより決定しました。その初期値は運用期間の中央の 2028-06-23 に CP マヌーバを実施して同様な目的を達成する場合のデルタVを参考にしました。",
            "description_en": "The Maneuver turns on the electric propulsion engine (EP) and specifies its parameters.\n\nDuring the 400-day powered flight that follows the Maneuver, the Probe will make the orbital transition to approach Juno on 2031-05-03.\n\nWe decided on the parameters of the Maneuver by cut-and-try.  For a reference, we used delta-V of a CP Maneuver that makes the equivalent orbital transition on 2028-06-23, the midpoint of the powered flight."
        },
        {
            "type": "FLYTO",
            "time": 2462145.5,
            "inter": 1.0,
            "description_ja": "探査機を 400 日間飛行させます。電気推進エンジン（EP）がオンになっていますので、この飛行は推力飛行（パワーフライト）です。",
            "description_en": "The Maneuver flies the Probe for 400 days. It is a powered flight because the electric propulsion engine is on."
        },
        {
            "type": "EP_OFF",
            "description_ja": "電気推進エンジン（EP）をオフにします。\n\n探査機は 2031-05-03 ごろに Juno に接近する軌道に乗っています。",
            "description_en": "The Maneuver turns off the electric propulsion engine.\n\nThe Probe is on an orbit that arrives at Juno on 2031-05-03 or around."
        },
        {
            "type": "CP",
            "dv": 14.493,
            "phi": -6.21,
            "elv": -80.38,
            "description_ja": "化学推進エンジン（CP）を運用して軌道を調整します。\n目標は 2031-05-03 に探査機が Junoにより接近することです。CP マヌーバのパラメータは SSVG の FTA 機能を使用して設定しました。",
            "description_en": "The Maneuver makes an orbital correction with the chemical propulsion engine (CP).  The new orbit brings the Probe to Juno at 2031-05-03.\n\nWe obtained the parameters of the Maneuver by FTA.\n\n"
        },
        {
            "type": "CP",
            "dv": 3.9,
            "phi": 154.0,
            "elv": -54.0,
            "description_ja": "化学推進エンジン（CP）を運用して、探査機の実経路（FLYTO マヌーバでの飛行結果）が 2031-05-03 にもっと接近するよう軌道を微調整します。\n\nCP マヌーバのパラメータはカットアンドトライで決定しました。\n\nこのマヌーバの実行により、探査機は 2031-05-03 に 2576 km にまで接近する軌道に乗ります。接近時のターゲットの相対速度は 2731 m/s です。",
            "description_en": "The Maneuver makes an additional orbital correction of the Probe to approach Juno more closely.\n\nWe decided on the parameters by cut-and-try.\n\nAfter the execution of the Maneuver, the Probe is on an orbit that approaches Juno within 2600 km.  The relative velocity at the approach is 2731 m/s."
        },
        {
            "type": "FLYTO",
            "time": 2462839.5,
            "inter": 5.0,
            "description_ja": "探査機を 2030-12-04 までの 694 日間飛行させます。\n\nこの飛行により、探査機の Juno への到着目標日まで 150 日になります。これから 300 日間電気推進エンジン（EP）を運用し探査機を Juno にランデブーさせる計画です。",
            "description_en": "The Maneuver flies the Probe for 694 days, until 2030-12-04.\n\nAt the end of the Maneuver, it is 150 days before the approach of the Probe to Juno.  The Probe will use the electric propulsion engine for 300 days and make the rendezvous with Juno."
        },
        {
            "type": "EP_ON",
            "dvpd": 9.115,
            "phi": 68.51,
            "elv": -32.1,
            "tvmode": "E",
            "description_ja": "電気推進エンジン（EP）をオンにし、今後 300 日間の運用で使用するパラメータを設定します。\n\nEP のパラメータはカットアンドトライで決定しました。目標は 300 日後の 2031-09-30 に探査機が Juno にランデブーすることです。\n\nカットアンドトライの初期値は、現在の軌道で探査機が Juno に到着したときの相対速度を参考にして決定しました。",
            "description_en": "The Maneuver turns on the electric propulsion engine (EP) and specifies its parameters.\n\nOn 2031-09-30, at the end of the 300-day powered flight that follows the Maneuver, the Probe will make the rendezvous with Juno.\n\nWe decided on the parameters of the Maneuver by cut-and-try.  For a reference, we used the relative velocity of the Target at the arrival of the Probe with its current orbit."
        },
        {
            "type": "FLYTO",
            "time": 2463139.5,
            "inter": 1.0,
            "description_ja": "探査機を 300 日間飛行させます。電気推進エンジン（EP）がオンになっていますので、この飛行は推力飛行（パワーフライト）です。この飛行により、探査機は徐々に相対速度を小さくしながら Juno に接近します。\n\nこの飛行が終わった時点で 探査機は Juno に 11000 km まで接近し、なお接近中です。",
            "description_en": "The Maneuver flies the Probe for 300 days. It is a powered flight because the EP is on. During it, the Probe approaches at Juno with gradually decreasing relative velocity.\n\nAt the end of the Maneuver, the Probe is 11000 km from Juno and still approaching."
        },
        {
            "type": "EP_OFF",
            "description_ja": "電気推進エンジン（EP）をオフにします。",
            "description_en": "The Maneuver turns off the electric propulsion engine."
        },
        {
            "type": "CP",
            "dv": 14.588,
            "phi": -11.29,
            "elv": -10.87,
            "description_ja": "化学推進エンジン（CP）を運用し、探査機が 5 日後に Juno の軌道前方 1000 km の地点に到着するよう軌道を変更します。\n\nCP のパラメータは SSVG の FTA 機能を用いて求めました。",
            "description_en": "The Maneuver makes an orbital correction with the chemical propulsion engine (CP) and makes the Probe will come to the targeting point, 1000 km before Juno on its orbit, after a five-day flight.\n\nWe obtained the parameters of the Maneuver by FTA."
        },
        {
            "type": "FLYTO",
            "time": 2463144.5,
            "inter": 1.0,
            "description_ja": "探査機を 5 日間飛行させます。\nこの飛行により探査機は Juno の軌道前方 1000 km の地点に到着します。",
            "description_en": "The Maneuver flies the Probe for five days.\n\nAt the end of the flight, the Probe is 1000 km before Juno on its orbit."
        },
        {
            "type": "CP",
            "dv": 23.12,
            "phi": -15.05,
            "elv": -2.85,
            "description_ja": "ターゲットとの相対速度をゼロにするマヌーバ（1 回目）です。",
            "description_en": "The Maneuver is the first Maneuver to zero the relative velocity of the Target."
        },
        {
            "type": "CP",
            "dv": 0.001,
            "phi": -83.24,
            "elv": 46.1,
            "description_ja": "ターゲットとの相対速度をゼロにするマヌーバ（2 回目）です。",
            "description_en": "The Maneuver is the second Maneuver to zero the relative velocity of the Target."
        },
        {
            "type": "CP",
            "dv": 0.075,
            "phi": 84.1,
            "elv": 0.0,
            "description_ja": "Juno に正確にランデブーするための追加の軌道修正です。\n\nこの軌道修正により、探査機は Juno との位置関係を保ったままで太陽を公転できるようになります。",
            "description_en": "The Maneuver makes a small correction of the orbit to complete the rendezvous with Juno."
        },
        {
            "type": "FLYTO",
            "time": 2464736.5,
            "inter": 5.0,
            "description_ja": "探査機を 1592 日間飛行させます。探査機は Juno にランデブーした状態で太陽を 1 公転します。\n\nこの飛行で探査機が Juno にランデブーした状態を続けることができるのは、 経路の計算に Juno が探査機に及ぼす引力が考慮されていないためです。実際の探査機を Juno の近傍に長期間留まらせるためには、探査機を Juno 周回軌道に投入する必要があります。",
            "description_en": "The Maneuver flies the Probe for 1592 days.  During the flight, the Probe completes one orbit around the Sun with Juno.\n\nThe trajectory of the Probe of the flight is not so real because SSVG does not take into account the gravity of Juno.  On an actual spaceflight, you should make the Probe enter into Juno orbit if you wish to keep it beside Juno for a long period."
        }
    ]
}