{
    "maneuvers": [
        {
            "elv": 19.1,
            "phi": 18.51,
            "type": "START",
            "time": 2443376.0999999996,
            "dv": 9705.0,
            "description_ja": "この飛行計画は、NASA の探査機ボイジャー2号の旅を再現したものですが、再現は精密ではありません。\n参考資料： http://www.jpl.nasa.gov/news/fact_sheets/voyager.pdf\n\n探査機は 1977 年 8 月 20 日に木星に向けて宇宙基地を出発します。\n探査機の最初の目標は、1979 年 7 月 9 日に木星に到着してスイングバイを行うことです。\n\n普通に考えるとその日に木星に接近する軌道に探査機を送りだせばよさそうですが、それでは木星の引力の影響で木星到着が 10 日近く早くなってしまいます。そこで、この飛行計画では 1979 年 7 月 18 日に木星に接近する軌道に探査機を送り出します。\n\n探査機を出発させる START マヌーバのパラメータは FTA でもとめた値を、引き続く FLYTO マヌーバの結果に基づいて手直ししたものです。",
            "description_en": "This Flight Plan is a replication of the spaceflight of Voyager 2, a space probe of NASA/JPL that explored all of the four giant planets of the solar system.  However, the replication is not so accurate.\n\nThe Probe leaves the space station \"Earth L2\" on 1977-08-20 (August 20, 1977) and flies toward Jupiter.  The first target of the spaceflight is the Jupiter swing-by on 1979-07-09 (July 9, 1979).\n\nBecause of the acceleration by the gravity of Jupiter, the Probe arrives at Jupiter earlier than a passing date on its two-body orbit.\n\nSo, we should send off the Probe with an initial orbit that passes Jupiter later than the date of swing-by.  \n\nWe tried several spaceflights and found an orbit that satisfies the objective date.  The Probe passes Jupiter on 1979-07-18 (July 18, 1979), eleven days after the planned swing-by, by the two-body orbit.  The gravity of Jupiter accelerates the Probe, and the actual swing-by occurs on the planned date.\n\nWe obtained the parameters of the Maneuver by the FTA function of SSVG and modified them based on several trial runs of Maneuvers.\n\n"
        },
        {
            "type": "FLYTO",
            "time": 2443425.5,
            "inter": 1.0,
            "description_ja": "探査機を 10 月 9 日までの 50 日間飛行させます。\n\nこの飛行により、探査機は地球を離れ、今後の予定が立てやすくなります。\nこの時点では軌道は問題なさそうです。",
            "description_en": "This Maneuver flies the Probe for 50 days until 1977-10-09 (October 9, 1977).\n\nThe Probe draws away from the Earth by the flight; it makes the planning of the subsequent spaceflight easy.\n\nAt this point, the orbit of the Probe is on the planned line."
        },
        {
            "type": "FLYTO",
            "time": 2443892.5,
            "inter": 5.0,
            "description_ja": "探査機を 1979 年 1 月 22 日までの 467 日間飛行させます。\n\nこの飛行により、探査機が2体問題軌道で木星に接近するまで 180 日になります。",
            "description_en": "This Maneuver flies the Probe for 467 days until 1979-01-22 (January 22, 1979).\n\nAt the end of the flight, the Probe is 180 days before the approach to Jupiter on its two-body orbit."
        },
        {
            "elv": 44.66,
            "phi": 152.53,
            "type": "CP",
            "dv": 29.452,
            "description_ja": "木星スイングバイのための軌道修正を行います。\nこのスイングバイにより、探査機を次の目標の土星に向かう軌道に乗せます。\n\n軌道変更のパラメータは FTA で求めました。FTA の条件は次のようになりました。\n　ターゲット： 木星\n　飛行時間： 180.0 日\n　目標位置の設定方法： B プレーン座標\n　オフセット距離： 1898000 km\n　beta （角度ベータ）： 2.87 度\n\nFTAの条件は、土星に正確に接近できるよう複数のパラメータを試して決めたものです。",
            "description_en": "This Maneuver performs an orbital correction to prepare Jupiter swing-by.\nThe objective of the swing-by is putting the Probe into an orbit that brings the Probe to Saturn. \n\nWe obtained the parameters of the Maneuver by the FTA function of SSVG.  The execution conditions of the FTA were as follows:\n  Target: Jupiter\n  Time to Arrival: 180.0 days\n  Precise Targeting: B-plane coordinates\n  offset distance: 1898000 km\n  beta: 2.87 deg\n\nWe determined those conditions by cut-and-try.\n\n"
        },
        {
            "type": "FLYTO",
            "time": 2444054.0,
            "inter": 5.0,
            "description_ja": "探査機を 6 月 29.5 日までの 161.5 日間飛行させます。\n\nこの飛行により、木星スイングバイまで 10.5 日になります。",
            "description_en": "This Maneuver flies the Probe for 161.5 days until 1979-06-29 (June 29, 1979).\n\nAt the end of the flight, the Probe is ten and a half days before the Jupiter swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2444074.0,
            "inter": 0.5,
            "description_ja": "探査機を 7 月 19.5 日まで 20 日間飛行させます。\n\nこの飛行により探査機は木星でスイングバイを行い、軌道を大きく変えて土星に向かいます。\n\n木星でのスイングバイは UT （世界時）で 7 月 10 日 0 時ごろになりました。",
            "description_en": "This Maneuver flies the Probe for 20 days until 1979-07-19 (July 19, 1979).\n\nThe Probe performs the Jupiter swing-by during the flight; the Probe flies toward Saturn after the swing-by.\n\nThe Jupiter swing-by occurs at about 0 o'clock of 1979-07-10 (July 10, 1979) on GMT."
        },
        {
            "type": "CP",
            "dv": 43.0,
            "phi": 180.0,
            "elv": 0.0,
            "description_ja": "木星のスイングバイの速度が少し大き過ぎたようで、このまま飛行すると土星到着時期が実際のボイジャー2号よりも早くなってしまいます。\n\n探査機の速度を少し小さくするマヌーバを行います。dv （デルタV の絶対値）の値は複数の値を試して 43.0 m/s を選びました。",
            "description_en": "At this point, we observed the orbit of the Probe and found that the arrival to Saturn would occur earlier than expected.  It means that the velocity of the Probe relative to Jupiter at the swing-by was a little faster than the real trajectory of Voyager 2.\n\nThis Maneuver performs an orbital correction to decelerate the Probe.  We determined the value of 43.0 m/s by cut-and-try for the parameter dv of the Maneuver."
        },
        {
            "type": "FLYTO",
            "time": 2444663.5,
            "inter": 5.0,
            "description_ja": "探査機を 1981 年 2 月 28 日までの 589.5 日飛行させます。\n\nこの飛行により、探査機は土星接近目標日まで 180 日になります。",
            "description_en": "This Maneuver flies the Probe for 589.5 days until 1981-02-28 (February 28, 1981).\n\nAt the end of the flight, the Probe is 180 days before the Saturn swing-by."
        },
        {
            "elv": 8.03,
            "phi": 64.42,
            "type": "CP",
            "dv": 6.338,
            "description_ja": "土星スイングバイのための軌道修正を行います。\nこのスイングバイにより、探査機を天王星に向かう軌道に乗せます。\n\n軌道変更のパラメータは FTA で求めました。FTA の条件は次のようになりました。\n　ターゲット： 土星\n　飛行時間： 180.0 日\n　目標位置の設定方法： B プレーン座標\n　オフセット距離： 379250 km\n　beta （角度ベータ）： -3.1 度\n\nFTA の条件は複数の値を試して最適なものを探しました。",
            "description_en": "This Maneuver performs an orbital correction of the Probe to prepare the Saturn swing-by.\nThe objective of the swing-by is putting the Probe into an orbit that brings the Probe to Uranus.\n\nWe obtained the parameters of the Maneuver by the FTA function of SSVG.  The execution conditions of the FTA were as follows:\n  Target: Saturn\n  Time to Arrival: 180.0 days\n  Precise Targeting: B-plane coordinates\n  offset distance: 379250 km\n  beta: -3.1 deg\n\nWe determined those conditions by cut-and-try.\n\n"
        },
        {
            "type": "FLYTO",
            "time": 2444832.5,
            "inter": 5.0,
            "description_ja": "探査機を 8 月 16 日までの 169 日間飛行させます。\n\nこの飛行により、土星スイングバイまで 9 日ほどになります。",
            "description_en": "This Maneuver flies the Probe for 169 days until 1981-08-16 (August 16, 1981).\n\nAt the end of the flight, the Probe is about nine days before the Saturn swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2444852.5,
            "inter": 0.05,
            "description_ja": "探査機を 9 月 5 日までの 20 日間飛行させます。\n\nこの飛行中に探査機は土星スイングバイを行い、天王星に向かう軌道に乗ります。",
            "description_en": "This Maneuver flies the Probe for 20 days until 1981-09-05 (September 5, 1981).\n\nThe Probe performs the Saturn swing-by during the flight; it flies toward Uranus after the swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2446080.5,
            "inter": 5.0,
            "description_ja": "探査機を 1985 年 1 月 15 日までの 1228 日間飛行させます。\n\nこの飛行により、天王星接近の目標日まで 375 日となります。",
            "description_en": "This Maneuver flies the Probe for 1228 days until 1985-01-15 (January 15, 1985).\n\nAt the end of the flight, the Probe is 375 days before the Uranus swing-by."
        },
        {
            "elv": 48.7,
            "phi": -143.98,
            "type": "CP",
            "dv": 3.784,
            "description_ja": "天王星スイングバイのための軌道修正を行います。\nこのスイングバイにより、探査機を海王星に向かう軌道に乗せます。\n\n軌道変更のパラメータは FTA で求めました。FTA の条件は次のようになりました。\n　ターゲット： 天王星\n　飛行時間： 375.2 日\n　目標位置の設定方法： B プレーン座標\n　オフセット距離： 87640 km\n　beta （角度ベータ）： 16.07 度\n\nFTA の条件は複数の値を試して最適なものを探しました。",
            "description_en": "This Maneuver performs an orbital correction of the Probe to prepare the Uranus swing-by.\nThe objective of the swing-by is putting the Probe into an orbit that brings the Probe to Neptune.\n\nWe obtained the parameters of the Maneuver by the FTA function of SSVG.  The execution conditions of the FTA were as follows:\n  Target: Uranus\n  Time to Arrival: 375.2 days\n  Precise Targeting: B-plane coordinates\n  offset distance: 87640 km\n  beta: 16.07 deg\n\nWe determined those conditions by cut-and-try.\n"
        },
        {
            "type": "FLYTO",
            "time": 2446445.5,
            "inter": 5.0,
            "description_ja": "探査機を 1986 年 1 月 15 日までの 365 日間飛行させます。\n\nこの飛行により天王星スイングバイまで 9 日になります。",
            "description_en": "This Maneuver flies the Probe for 365 days until 1986-01-15 (January 15, 1986).\n\nAt the end of the flight, the Probe is nine days before the Uranus swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2446465.5,
            "inter": 0.05,
            "description_ja": "探査機を 2 月 4 日までの 20 日間飛行させます。\n\nこの飛行の間に探査機は天王星スイングバイを行い、海王星に向かいます。",
            "description_en": "This Maneuver flies the Probe for 20 days until 1989-02-04 (February 4, 1986).\n\nThe Probe performs the Uranus swing-by during the flight; it flies toward Neptune after the swing-by."
        },
        {
            "type": "CP",
            "dv": 34.0,
            "phi": 0.0,
            "elv": 0.0,
            "description_ja": "海王星到着まで探査機を飛行させてみると、どうやら 2 日ほど遅れて到着してしまうようです。天王星スイングバイの速度が実際の飛行よりも遅かったと思われます。\n\nボイジャー 2号 が海王星に到着した 1989 年8月 25 日に探査機が到着するよう、探査機の速度を増加させます。dv （デルタV の絶対値）は複数の値を試して 34.0 m/s を選びました。",
            "description_en": "At this point, we observed the orbit of the Probe and found that the arrival to Neptune would occur two days later than expected.  It means that the velocity of the Probe relative to Uranus at the swing-by was a little slower than the real trajectory of Voyager 2.\n\nThis Maneuver performs an orbital correction to accelerate the Probe.  We determined the value of 34.0 m/s by cut-and-try for the parameter dv of the Maneuver."
        },
        {
            "type": "FLYTO",
            "time": 2447515.5,
            "inter": 5.0,
            "description_ja": "探査機を 1988 年 12 月 20 日までの 1050 日間飛行させます。\n\nこの飛行により、海王星到着目標日まで 249 日になります。",
            "description_en": "This Maneuver flies the Probe for 1050 days until 1988-12-20 (December 20, 1988).\n\nAt the end of the flight, the Probe is 249 days before the arrival to Neptune."
        },
        {
            "elv": 56.4,
            "phi": 97.21,
            "type": "CP",
            "dv": 9.096,
            "description_ja": "海王星スイングバイのための軌道修正を行います。\n探査機は海王星の北極上空を通過し、軌道を大きくまげて黄道面の南に向かいます。\n\n軌道変更のパラメータはFTAで求めました。FTA の条件は次のようになりました。\n　ターゲット： 海王星\n　飛行時間： 249 日\n　目標位置の設定方法： B プレーン座標\n　オフセット距離： 59000 km\n　beta （角度ベータ）： 238 度\n\nFTA の条件は、探査機が海王星の北極上空を通過し、最接近距離が 30000 km になるよう、複数の値を試して最適なものを選びました。",
            "description_en": "This Maneuver performs an orbital correction of the Probe to prepare the Neptune swing-by.\nThe probe passes above the north pole of Neptune, and it makes a steep turn of its orbit during the swing-by.   After that, it flies toward the south of the ecliptic plane.\n\nWe obtained the parameters of the Maneuver by the FTA function of SSVG.  The execution conditions of the FTA were as follows:\n  Target: Neptune\n  Time to Arrival: 249 days\n  Precise Targeting: B-plane coordinates\n  offset distance: 59000 km\n  beta: 238 deg\n\nWe determined those conditions by cut-and-try to obtain the following trajectory.\n  The Probe passes above the north pole of Neptune.\n  At the closest point, the distance of the Probe from Neptune center is 30000 km.\n"
        },
        {
            "type": "FLYTO",
            "time": 2447753.5,
            "inter": 5.0,
            "description_ja": "探査機を 1989 年 8 月 15 日まで 238 日間飛行させます。\n\nこの飛行により、海王星スイングバイまで 10 日ほどになります。",
            "description_en": "This Maneuver flies the Probe for 238 days until 1989-08-15 (August 15, 1989).\n\nAt the end of the flight, the Probe is about ten days before the  Neptune swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2447773.5,
            "inter": 0.05,
            "description_ja": "探査機を 9 月 4 日までの 20 日間飛行させます。\n\nこの飛行の間に探査機は海王星スイングバイを行い、経路を大きく変えて黄道面の南に向かいます。",
            "description_en": "This Maneuver flies the Probe for 20 days until 1989-09-04 (September 4, 1989).\n\nThe Probe performs the Neptune swing-by during the flight; it makes a steep turn of its orbit and flies toward the south of the ecliptic plane after the swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2449589.5,
            "inter": 5.0,
            "description_ja": "探査機を 1994 年 8 月 25 日までの 1816 日間飛行させます。\n\nこの飛行を終えると、海王星スイングバイからちょうど 5 年になります。",
            "description_en": "This Maneuver flies the Probe for 1816 days until 1994-08-25 (August 25, 1994).\n\nAt the end of the flight, the Probe is after five years of the Neptune swing-by."
        },
        {
            "type": "FLYTO",
            "time": 2459214.5,
            "inter": 50.0,
            "description_ja": "探査機を 2020 年 12 月 31 日までの 9625 日間飛行させます。\n\nこの飛行が終わると、探査機は打上げから 15838 日（43 年と 4か月余り）になります。太陽からの距離は 200 億キロメートルを超えているはずです。\n\nなお、最後のスイングバイ（海王星スイングバイ）の経路をボイジャー 2号の飛行経路に合わせることが難しいため、それ以後の経路は正確ではないと考えられます。",
            "description_en": "This Maneuver flies the Probe for 9625 days until 2020-12-31 (December 31, 2020).\n\nAt the end of the flight, the Probe is after 15838 days (a little more than 43 years and four months) from the start of the spaceflight.  The distance of the Probe would be more than 20 billion kilometers from the Sun.\n\nNote:\nBecause of the difficulty of the matching of the flight path during the Neptune swing-by, the trajectory of the Probe is not accurate in the last phase of the spaceflight."
        }
    ],
    "target": {
        "name": "Saturn",
        "file": "",
        "SPKID1A": 0,
        "SPKID1B": 6,
        "SPKID2A": 0,
        "SPKID2B": 0
    },
    "probe": {
        "name": "Voyager2",
        "base": "EarthL2",
        "pmass": 500.0
    }
}