{
    "probe": {
        "name": "myprobe",
        "base": "EarthL2",
        "pmass": 500.0
    },
    "target": {
        "name": "Apollo",
        "file": "2001862_Apollo.bsp",
        "SPKID1A": 0,
        "SPKID2A": 0,
        "SPKID2B": 0,
        "SPKID1B": 2001862
    },
    "maneuvers": [
        {
            "type": "START",
            "time": 2459468.5,
            "dv": 7300.177,
            "phi": -38.74,
            "elv": 40.86,
            "description_ja": "小惑星アポロの探査を行う飛行計画です。\n探査機を、アポロのすぐ近くを通り過ぎるように飛行させます。\n\nこのマヌーバは探査機を宇宙基地から出発させます。\n出発日時とパラメータ（速度と方向）は最適化アシスタントを利用して決定しました。\n\n最適化の条件は合計値（デルタVと到着時の相対速度の合計）の最小化です。",
            "description_en": "The Probe of the Flight Plan makes a flyby of the asteroid Apollo to explore it.\n\nThe START Maneuver makes the Probe begin the spaceflight.\nI decided the beginning date of the spaceflight and parameters of the Maneuver by using the START Optimize Assistant to minimize the Total DV (IDV + TRV)."
        },
        {
            "type": "FLYTO",
            "time": 2459498.5,
            "inter": 1.0,
            "description_ja": "このマヌーバでは、探査機を 30 日間飛行させます。\nこの飛行を終了した時点では、探査機が小惑星アポロに接近するまであと 190 日かかります。",
            "description_en": "The FLYTO Maneuver flies the Probe for 30 days.\nAt the end of the Maneuver, it is 190 days before the flyby of the Probe to the asteroid Apollo."
        },
        {
            "type": "CP",
            "dv": 48.188,
            "phi": -89.09,
            "elv": -70.64,
            "description_ja": "このマヌーバでは探査機の軌道を修正し、探査機が小惑星アポロに接近できるようにします。\n\n軌道修正のパラメータ（速度変化の大きさと方向）はFTAを使用して決定しました。\nFTAの実行条件は次のとおりです。\n　飛行時間：190.0 日\n　目標位置の指定方法：B プレーン座標\n　オフセット距離：100.0 km\n　beta：180.0 度",
            "description_en": "The CP Maneuver corrects the orbit of the Probe. It enables the Probe to make a close encounter with the asteroid Apollo.\n\nI decided on the parameters of the CP Maneuver by using the FTA function.\nThe parameters of the FTA are as follows:\n  Time to Arrival: 190.0 days\n  Precise Targeting: B-plane coordinates\n  offset distance: 100.0 km\n  beta: 180.0 deg"
        },
        {
            "type": "FLYTO",
            "time": 2459678.5,
            "inter": 1.0,
            "description_ja": "このマヌーバでは、探査機を 180 日間飛行させます。\nこの飛行の結果、探査機が小惑星アポロに接近するまで 9.81 日になります。",
            "description_en": "The FLYTO Maneuver flies the Probe for 180 days.\nAt the end of the Maneuver, it is 9.81 days before the flyby of the Probe to the asteroid Apollo."
        },
        {
            "type": "CP",
            "dv": 22.828,
            "phi": -14.89,
            "elv": -73.52,
            "description_ja": "このマヌーバでは探査機の軌道を修正します。\n\n軌道修正のパラメータ（速度変化の大きさと方向）は FTA を使用して決定しました。\nFTAの実行条件は次のとおりです。\n　飛行時間：9.81 日\n　目標位置の指定方法：B プレーン座標\n　オフセット距離：100.0 km\n　beta：180.0 度",
            "description_en": "The CP Maneuver corrects the orbit of the Probe.\n\nI decided on the parameters of the CP Maneuver by using the FTA function.\nThe parameters of the FTA are as follows:\n  Time to Arrival: 9.81 days\n  Precise Targeting: B-plane coordinates\n  offset distance: 100.0 km\n  beta: 180.0 deg"
        },
        {
            "type": "FLYTO",
            "time": 2459688.2,
            "inter": 1.0,
            "description_ja": "このマヌーバでは探査機を 9.7 日間飛行させます。\nこの飛行により、探査機が小惑星アポロに接近するまで 0.11 日（2 時間 38 分）になります。\n",
            "description_en": "The FLYTO Maneuver flies the Probe for 9.7 days.\nAt the end of the Maneuver, it is 0.11 days (2 hours and 48 minutes) before the flyby of the Probe to the asteroid Apollo."
        },
        {
            "type": "FLYTO",
            "time": 2459688.4000000004,
            "inter": 0.0001,
            "description_ja": "このマヌーバでは探査機を 0.2 日間（4 時間 48 分）飛行させます。\nこの飛行中に探査機は小惑星アポロのすぐ近くを通り過ぎます。\n\nこのマヌーバでは、数値積分の積分間隔を 1 万分の 1 日（8.64秒）にしています。マヌーバの実行後に飛行レビューを行えば、探査機が小惑星アポロの近くを通り過ぎる様子を詳しく確認できるでしょう。",
            "description_en": "The FLYTO Maneuver flies the Probe for 0.2 days.\nWithin the flight, the Probe makes a close flyby of the asteroid Apollo.\n\nThe interval of the numerical integration of the FLYTO Maneuver is one ten-thousandth day (8.64 seconds). \n\nTo watch the flyby, use the Flight Review function after the execution of the FLYTO Maneuver."
        }
    ]
}